#+TITLE: Tar Pit
#+PROPERTY: header-args :mkdirp yes

** Relvar infrastructure

#+BEGIN_SRC clojure :noweb no-export :tangle ../frp/infrastructure.clj
(ns com.owoga.frp.infrastructure
  (:require [clojure.set :as set]))
<<relvar protocols>>
<<relvar implementations>>
#+END_SRC

#+BEGIN_SRC clojure :results pp
(ns example
  (:require [com.owoga.frp.infrastructure :refer [->BaseRelVar project load!]]))

(def Offer (->BaseRelVar 'Offer nil (atom #{})))
(def OfferPrices (project Offer [:price]))

(load! Offer #{{:address "123 Fake St." :price 2e5}})
(assert (= #{{:price 2e5}} @OfferPrices))
(print @OfferPrices)
#+END_SRC

#+RESULTS:
: #{{:price 200000.0}}
:

